In [1]:
import pandas as pd

In [2]:
df_cat = pd.read_csv("preferences/cat.csv")
df_loc =  pd.read_csv("preferences/loc.csv")
df_price =  pd.read_csv("preferences/price.csv")
df_rat =  pd.read_csv("preferences/rat.csv")
df_type =  pd.read_csv("preferences/type.csv")

## Categories

In [3]:
df_cat.head()

,name,age,category,subcategory,filter,time,weekday,gender,ocupation,children
0,Julieta,23.0,culture,theatre,category,2021-05-17 22:20:14.623386,0,Female,Studying,NO
1,Julieta,23.0,restaurant,gluten free,category,2021-05-17 22:20:29.212266,0,Female,Studying,NO

In [4]:
df_cat.drop(df_cat[df_cat.category == "select.."].index, inplace=True)
df_cat.drop(df_cat[df_cat.subcategory == "select.."].index, inplace=True)
df_cat = df_cat.reset_index()
df_cat.drop(["index"],axis=1,inplace=True)

In [5]:
df_cat

,name,age,category,subcategory,filter,time,weekday,gender,ocupation,children
0,Julieta,23.0,culture,theatre,category,2021-05-17 22:20:14.623386,0,Female,Studying,NO
1,Julieta,23.0,restaurant,gluten free,category,2021-05-17 22:20:29.212266,0,Female,Studying,NO

## Location

In [6]:
df_loc

,name,age,category,subcategory,filter,time,weekday,gender,ocupation,children
0,Julieta,23.0,Madrid,Chamartín,location,2021-05-17 22:20:45.635828,0,Female,Studying,NO
1,Julieta,23.0,Other towns in Madrid,Alcobendas,location,2021-05-17 22:21:01.088145,0,Female,Studying,NO

## Price

In [7]:
df_price

,name,age,category,filter,time,weekday,gender,ocupation,children
0,Julieta,23.0,70,price,2021-05-17 22:21:24.522554,0,Female,Studying,NO

## Type

In [8]:
df_type

,name,age,category,filter,time,weekday,gender,ocupation,children
0,Julieta,23.0,couple,type,2021-05-17 22:21:10.454728,0,Female,Studying,NO
1,Julieta,23.0,individual,type,2021-05-17 22:21:15.897282,0,Female,Studying,NO

## Rating

In [9]:
df_rat

,name,age,category,filter,time,weekday,gender,ocupation,children
0,Julieta,23.0,4.9,rating,2021-05-17 22:21:35.810915,0,Female,Studying,NO

In [11]:
pd.concat([df_rat,df_type,df_price,df_loc,df_cat])

,name,age,category,filter,time,weekday,gender,ocupation,children,subcategory
0,Julieta,23.0,4.9,rating,2021-05-17 22:21:35.810915,0,Female,Studying,NO,NaN
0,Julieta,23.0,couple,type,2021-05-17 22:21:10.454728,0,Female,Studying,NO,NaN
1,Julieta,23.0,individual,type,2021-05-17 22:21:15.897282,0,Female,Studying,NO,NaN
0,Julieta,23.0,70,price,2021-05-17 22:21:24.522554,0,Female,Studying,NO,NaN
0,Julieta,23.0,Madrid,location,2021-05-17 22:20:45.635828,0,Female,Studying,NO,Chamartín
1,Julieta,23.0,Other towns in Madrid,location,2021-05-17 22:21:01.088145,0,Female,Studying,NO,Alcobendas
0,Julieta,23.0,culture,category,2021-05-17 22:20:14.623386,0,Female,Studying,NO,theatre
1,Julieta,23.0,restaurant,category,2021-05-17 22:20:29.212266,0,Female,Studying,NO,gluten free